#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.music.data.digitalocean_domain.this: Reading...
digitalocean_droplet.do4: Refreshing state... [id=295334596]
digitalocean_domain.rileysnyder_org: Refreshing state... [id=rileysnyder.org]
module.code.data.digitalocean_domain.this: Reading...
module.babychelladj.data.digitalocean_domain.this: Reading...
digitalocean_droplet.do3: Refreshing state... [id=295334593]
digitalocean_droplet.do5: Refreshing state... [id=295334592]
digitalocean_droplet.do2: Refreshing state... [id=295334595]
digitalocean_droplet.do1: Refreshing state... [id=295334594]
digitalocean_droplet.do0: Refreshing state... [id=295334591]
module.music.data.digitalocean_domain.this: Read complete after 0s [id=rileysnyder.org]
module.music.digitalocean_record.this-cname: Refreshing state... [id=290143342]
module.babychelladj.data.digitalocean_domain.this: Read complete after 0s [id=rileysnyder.org]
module.babychelladj.digitalocean_record.this-cname: Refreshing state... [id=326033787]
module.code.data.digitalocean_domain.this: Read complete after 0s [id=rileysnyder.org]
module.code.digitalocean_record.this-cname: Refreshing state... [id=290143978]
digitalocean_record.metrics: Refreshing state... [id=284235809]
digitalocean_record.send: Refreshing state... [id=332760231]
digitalocean_record.requests: Refreshing state... [id=302658815]
digitalocean_record.s3: Refreshing state... [id=304234736]
digitalocean_record.cameras: Refreshing state... [id=339470117]
digitalocean_record.instance["oca0"]: Refreshing state... [id=291765558]
digitalocean_record.github_pages: Refreshing state... [id=285402102]
digitalocean_record.parson_tesla: Refreshing state... [id=313648851]
digitalocean_record.minecraft: Refreshing state... [id=284235811]
digitalocean_record.pushmetrics: Refreshing state... [id=294894686]
digitalocean_record.files: Refreshing state... [id=284235810]
digitalocean_record.instance["hurley"]: Refreshing state... [id=329987078]
digitalocean_record.do3: Refreshing state... [id=306011701]
digitalocean_record.do4: Refreshing state... [id=306011702]
digitalocean_record.do1: Refreshing state... [id=306011749]
digitalocean_record.do0: Refreshing state... [id=306011700]
module.babychelladj.digitalocean_record.this-txt: Refreshing state... [id=326033789]
module.music.digitalocean_record.this-txt: Refreshing state... [id=290143343]
digitalocean_record.do5: Refreshing state... [id=306011703]
digitalocean_record.do2: Refreshing state... [id=306011710]
module.code.digitalocean_record.this-txt: Refreshing state... [id=290143984]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_record.instance["hurley_local"] will be created
  + resource "digitalocean_record" "instance" {
      + domain = "rileysnyder.org"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "hurley_local"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "192.168.0.3"
    }

  # digitalocean_record.instance["kate"] will be created
  + resource "digitalocean_record" "instance" {
      + domain = "rileysnyder.org"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "kate"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "192.168.0.11"
    }

  # digitalocean_record.instance["oca1"] will be created
  + resource "digitalocean_record" "instance" {
      + domain = "rileysnyder.org"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "oca1"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = "129.153.88.119"
    }

  # pihole_dns_record.cameras will be created
  + resource "pihole_dns_record" "cameras" {
      + domain = "monitor.rileysnyder.org"
      + id     = (known after apply)
      + ip     = "192.168.0.3"
    }

  # pihole_dns_record.files will be created
  + resource "pihole_dns_record" "files" {
      + domain = "files.rileysnyder.org"
      + id     = (known after apply)
      + ip     = "192.168.0.3"
    }

  # pihole_dns_record.hurley will be created
  + resource "pihole_dns_record" "hurley" {
      + domain = "hurley.rileysnyder.org"
      + id     = (known after apply)
      + ip     = "192.168.0.3"
    }

  # pihole_dns_record.kate will be created
  + resource "pihole_dns_record" "kate" {
      + domain = "kate.rileysnyder.org"
      + id     = (known after apply)
      + ip     = "192.168.0.11"
    }

  # pihole_dns_record.metrics will be created
  + resource "pihole_dns_record" "metrics" {
      + domain = "metrics.rileysnyder.org"
      + id     = (known after apply)
      + ip     = "192.168.0.3"
    }

  # pihole_dns_record.requests will be created
  + resource "pihole_dns_record" "requests" {
      + domain = "requests.rileysnyder.org"
      + id     = (known after apply)
      + ip     = "192.168.0.3"
    }

  # pihole_dns_record.s3 will be created
  + resource "pihole_dns_record" "s3" {
      + domain = "s3.rileysnyder.org"
      + id     = (known after apply)
      + ip     = "192.168.0.3"
    }

  # pihole_dns_record.send will be created
  + resource "pihole_dns_record" "send" {
      + domain = "send.rileysnyder.org"
      + id     = (known after apply)
      + ip     = "192.168.0.3"
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @rssnyder, Action: `pull_request`*